.cf.xml/InformationRegisters/обм_КОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_КОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_ВерсияДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Послание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_КОтправке/Ext/ManagerModule.bsl
Процедура Зарегистрировать(пУзел, Знач пКатегория = Неопределено, Знач пИдентификатор = Неопределено, пСсылка = Неопределено, пПослание = Неопределено) Экспорт  
	
	// Проверить заполненность полезной нагрузки
	Если Не общ.ЭтоЗаполненнаяСсылка(пСсылка) И ПустаяСтрока(пПослание) Тогда
		Возврат;
		
	КонецЕсли; 
	
	Если пКатегория = Неопределено Тогда
		пКатегория = общ.Ссылка_ИмяТаблицы(пСсылка);
		
	КонецЕсли; 
	
	Если пИдентификатор = Неопределено Тогда
		пИдентификатор = НРег(пСсылка.УникальныйИдентификатор());
		
	КонецЕсли;
	
	// Проверить заполненность вектора
	Если
			ПустаяСтрока(пУзел)
		Или ПустаяСтрока(пКатегория)
		Или ПустаяСтрока(пИдентификатор)
	Тогда
		Возврат;
		
	КонецЕсли;

	запись = РегистрыСведений.обм_КОтправке.СоздатьМенеджерЗаписи();
	
	запись.Узел = пУзел;
	запись.Категория = пКатегория;
	запись.Идентификатор = пИдентификатор;
	
	запись.ДатаВремя = общ_Сервер.ТекущаяДатаНаСервере();
	запись.ВерсияДанных = пСсылка.ВерсияДанных;
	запись.Ссылка = пСсылка;
	запись.Послание = пПослание;
	запись.ФлагОшибки = Ложь;

	запись.Записать(Истина);
	
КонецПроцедуры

Процедура ЗарегистрироватьПоУмолчанию(пУзел, пСсылка) Экспорт 
	
	// Проверить заполненность параметров
	Если ПустаяСтрока(пУзел) Или Не общ.ЭтоЗаполненнаяСсылка(пСсылка) Тогда
		Возврат;
		
	КонецЕсли;
	
	стрПослание = обм.Послание_СформироватьПоУмолчанию(пСсылка);
	
	Если ПустаяСтрока(стрПослание) Тогда
		Возврат;
		
	КонецЕсли;
	
	РегистрыСведений.обм_КОтправке.Зарегистрировать(
			пУзел, // Узел
			, // Категория
			,  // Идентификатор
			пСсылка, // Ссылка
			стрПослание  // строка сообщения
			);
			
КонецПроцедуры

Процедура УдалитьРегистрацию(пУзел, пКатегория, пИдентификатор, пВерсияДанных = Неопределено) Экспорт
	
	// Проверить заполненность вектора
	Если
			ПустаяСтрока(пУзел)
		Или ПустаяСтрока(пКатегория)
		Или ПустаяСтрока(пИдентификатор)
	Тогда
		Возврат;
		
	КонецЕсли;
	
	запись = РегистрыСведений.обм_КОтправке.СоздатьМенеджерЗаписи();
	запись.Узел = пУзел;
	запись.Категория = пКатегория;
	запись.Идентификатор = пИдентификатор;
	
	запись.Прочитать(); 
	
	Если запись.Выбран() Тогда
		можноУдалить =  
			?(
				Не пустаяСтрока(пВерсияДанных),
				запись.Ссылка.ВерсияДанных = пВерсияДанных, 
				запись.Ссылка.ВерсияДанных = запись.ВерсияДанных 
				);
		
		Если можноУдалить Тогда
			запись.Удалить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоднятьФлагОшибки(пУзел, пКатегория, пИдентификатор) Экспорт
	
	// Проверить заполненность вектора
	Если
			ПустаяСтрока(пУзел)
		Или ПустаяСтрока(пКатегория)
		Или ПустаяСтрока(пИдентификатор)
	Тогда
		Возврат;
		
	КонецЕсли;
	
	запись = РегистрыСведений.обм_КОтправке.СоздатьМенеджерЗаписи();
	запись.Узел = пУзел;
	запись.Категория = пКатегория;
	запись.Идентификатор = пИдентификатор;
	
	запись.Прочитать();
	
	Если Не запись.Выбран() Тогда
		Возврат;
		
	КонецЕсли;
	
	запись.ФлагОшибки = Истина;
	
	запись.Записать(Истина);
	
КонецПроцедуры

Процедура СброситьВсеФлагиОшибки() Экспорт
	
	запрос = Новый Запрос;
	запрос.Текст =
	"Выбрать Т.* Из РегистрСведений.обм_КОтправке КАК Т ГДЕ Т.ФлагОшибки";
	
	выборка = запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		
		запись = РегистрыСведений.обм_КОтправке.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(запись, выборка);
		
		запись.ФлагОшибки = Ложь;
		
		запись.Записать(Истина);		
		
	КонецЦикла;
	выборка.Сбросить();
	
КонецПроцедуры
